# **Final Project**

IST340 Knowledge Discovery and Data Mining

Group 1: **Yuri Yu**, **Irma Covarrubias**, **Patrick Watkins**

## Load required libraries

In [2]:
import pandas as pd
import re

## Working directory

In [3]:
# from google.colab import drive
# drive.mount('/content/drive')

## Load data

### Load the raw files

In [4]:
# Define a function for reading prolog files
def read_prolog_file(filename):
    with open(filename, 'r') as f:
        content = f.readlines()
    return content

In [5]:
# read the no_payment_due.pl and extract StudentID and NoPaymentDue
content1 = read_prolog_file(filename='datasets\\no_payment_due.pl')

facts = []
for line in content1:
    match = re.match(r'no_payment_due\(student(\d+),(.+)\)\.', line.strip())
    if match:
        studentid, status = match.groups()
        facts.append([studentid, status])
        
df1 = pd.DataFrame(facts, columns=['StudentID', 'NoPaymentDue'])
display(df1.head(), df1.shape)

  StudentID NoPaymentDue
0      1000          pos
1       999          pos
2       998          pos
3       996          pos
4       994          pos

(1000, 2)

In [6]:
# Enlisted file for Enlisted and Service
content2 = read_prolog_file(filename='datasets\\enlist.pl')

facts = []
for line in content2:
    match = re.match(r'enlist\(student(\d+),(.+)\)\.', line.strip())
    if match:
        studentid, service = match.groups()
        facts.append([studentid, service])

df2 = pd.DataFrame(facts, columns=['StudentID', 'Service'])
display(df2.head(), df2.shape)

  StudentID          Service
0        40  fire_department
1        51  fire_department
2       109  fire_department
3       139  fire_department
4       148  fire_department

(306, 2)

In [7]:
# read Disabled file for Disabled
content3 = read_prolog_file(filename='datasets\\disabled.pl')

facts = []
for line in content3:
    match = re.match(r'disabled\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0], 'Disabled'])

df3 = pd.DataFrame(facts, columns=['StudentID', 'Disabled'])
display(df3.head(), df3.shape)

  StudentID  Disabled
0       992  Disabled
1       976  Disabled
2       963  Disabled
3       918  Disabled
4       913  Disabled

(95, 2)

In [8]:
# read Unemployed file for Unemployed
content4 = read_prolog_file(filename='datasets\\unemployed.pl')

facts = []
for line in content4:
    match = re.match(r'unemployed\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0], 'Unemployed'])

df4 = pd.DataFrame(facts, columns=['StudentID', 'Unemployed'])
display(df4.head(), df4.shape)

  StudentID  Unemployed
0      1000  Unemployed
1       996  Unemployed
2       993  Unemployed
3       948  Unemployed
4       946  Unemployed

(98, 2)

In [9]:
# read Enrolled file for Enrolled and School
content5 = read_prolog_file(filename = 'datasets\\enrolled.pl')

facts = []
for line in content5:
    match = re.match(r'enrolled\(student(\d+),(.+),(.+)\)\.', line.strip())
    if match:
        studentid, school, units = match.groups()
        facts.append([studentid, school, units])

df5 = pd.DataFrame(facts, columns=['StudentID', 'School', 'Units'])
display(df5.head(), df5.shape)

  StudentID School Units
0        10    ucb     2
1        18   ucsd     4
2        20   ucsd     3
3        35   ucsd     4
4        44   ucsd     1

(1194, 3)

In [19]:
# read Region file for Country, Region, Marital_Status
# from Region,Martial Status.xlsx
df6 = pd.read_excel('datasets\Region, Marital Status.xlsx')
df6.columns = ['StudentID', 'Country', 'Region', 'Marital_Status']
display(df6.head(), df6.shape)

   StudentID Country  Region  Marital_Status
0          1     USA       2               1
1          2     USA       5               0
2          3     USA       2               1
3          4     USA       1               0
4          5     USA       3               0

(1000, 4)

In [20]:
# read male.pl for Gender
content7 = read_prolog_file(filename = 'datasets\\male.pl')

facts = []
for line in content7:
    match = re.match(r'male\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0],'Male'])

df7 = pd.DataFrame(facts,columns=['StudentID', 'Gender'])
display(df7.head(), df7.shape)

  StudentID Gender
0       997   Male
1       994   Male
2       992   Male
3       987   Male
4       986   Male

(497, 2)

In [22]:
# read longest_absense_from_school.pl for Longest_Absence_From_School
content8 = read_prolog_file(filename = 'datasets\\longest_absense_from_school.pl')

facts = []
for line in content8:
    match = re.match(r'longest_absense_from_school\(student(\d+),(.+)\)\.', line.strip())
    if match:
        studentid, months = match.groups()
        facts.append([studentid, months])

df8 = pd.DataFrame(facts,columns=['StudentID', 'Longest_Absence_From_School'])
display(df8.head(), df8.shape)

  StudentID Longest_Absence_From_School
0      1000                           7
1       999                           4
2       998                           1
3       997                           8
4       996                           7

(1000, 2)

In [25]:
# read filed_for_bankrupcy.pl for Filed_For_Bankruptcy
content9 = read_prolog_file(filename = 'datasets\\filed_for_bankrupcy.pl')

facts = []
for line in content9:
    match = re.match(r'filed_for_bankrupcy\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0], 'Filed_For_Bankruptcy'])

df9 = pd.DataFrame(facts,columns=['StudentID', 'Filed_For_Bankruptcy'])
display(df9.head(), df9.shape)

  StudentID  Filed_For_Bankruptcy
0       999  Filed_For_Bankruptcy
1       998  Filed_For_Bankruptcy
2       958  Filed_For_Bankruptcy
3       956  Filed_For_Bankruptcy
4       953  Filed_For_Bankruptcy

(96, 2)

In [27]:
# read Personality Characteristics file for LongTermPlanningScore, DecisionStyle, PowerOrientedScore, CommunityOrientedScore
df10 = pd.read_excel('datasets\Personality Characteristics Data.xlsx')
df10.columns = ['StudentID', 'LongTermPlanningScore', 'DecisionStyle', 'PowerOrientedScore', 'CommunityOrientedScore']
display(df10.head(), df10.shape)

,StudentID,LongTermPlanningScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore
0,1,0.956004,Emotional,0.767967,0.189491
1,2,0.601589,Analytical,1.000000,0.529815
2,3,0.655254,Emotional,0.589539,0.589539
3,4,0.841278,Emotional,0.805702,0.061538
4,5,0.738851,Emotional,0.415433,0.241257

(1000, 5)

In [28]:
# read Family_Income file for Family_Income
df11 = pd.read_excel('datasets\Family_Income.xlsx')
df11.columns = ['StudentID', 'Family_Income']
display(df11.head(), df11.shape)

   StudentID  Family_Income
0          1      109770.95
1          2       58442.99
2          3       97125.87
3          4       55256.40
4          5       58187.16

(1000, 2)

In [30]:
# Parents_Education file for Parent_Education_Level
df12 = pd.read_excel('datasets\Parents_Education.xlsx')
df12.columns = ['StudentID', 'Parent_Education_Level']
display(df12.head(), df12.shape)

   StudentID Parent_Education_Level
0          1             Bachelor's
1          2              Doctorate
2          3            HS or Lower
3          4               Master's
4          5               Master's

(1000, 2)

In [31]:
# read CreditRating Data 2012.xlsx for Credit_Score_Raw and Credit_Score_AgeAdj
df13 = pd.read_excel('datasets\CreditRating Data 2012.xlsx')
df13.columns = ['StudentID', 'Credit_Score_Raw', 'Credit_Score_AgeAdj']
display(df13.head(), df13.shape)

   StudentID  Credit_Score_Raw  Credit_Score_AgeAdj
0          1          0.495227             0.767967
1          2          0.987649             0.529815
2          3          0.249315             0.589539
3          4          0.653183             0.805702
4          5          0.273099             0.415433

(1000, 3)

In [32]:
# read LoanAmount.xlsx for Loan_Amount
df14 = pd.read_excel('datasets\LoanAmount.xlsx')
df14.columns = ['StudentID', 'Loan_Amount']
display(df14.head(), df14.shape)

   StudentID  Loan_Amount
0          1        19861
1          2        17391
2          3         8118
3          4        18905
4          5        16175

(1000, 2)

In [33]:
# read HS_Academics 2012.xlsx for HS_Math, HS_Science, HS_English
df15 = pd.read_excel('datasets\HS_Academics 2012.xlsx')
df15.columns = ['StudentID', 'HS_Math', 'HS_Science', 'HS_English']
display(df15.head(), df15.shape)

   StudentID  HS_Math  HS_Science  HS_English
0          1       10          10        10.0
1          2        9           9        10.0
2          3        9           6         6.0
3          4       10           9         9.0
4          5        6           8         5.0

(1000, 4)